{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "Ann-Katrine, Jesper \u0026 Piriya"
  },
  "text": {
    "more": "The Network of Danish Politicians is part of our exam project for the course 02805 Social Graphs and Interactions. Two different datasets are used to create this graph. The first dataset is a list of all Danish politicians, both former and current. The dataset contains information about which party they belong to and if they are in the current Danish parliament or EU parliament. This dataset was scraped from the website danskepolitikere.dk. The politician’s names where used to guess the gender which was added as an attribute to the dataset. The second dataset consist of the Wikipedia texts for all the Danish politicians who have a Wikipedia page and are in the first dataset. The information from the Wikipedia page was used to extract the age and the links to other politicians Wikipedia page. These links represent edges in the network.",
    "intro": "This is a model of the Danish Politician Network.\nBoth current and former politicians are included if they a Danish Wikipedia page. \nThe edges in are the Wikipedia links from a politician\u0027s page to another politician\u0027s page. \nThe nodes are colored according to party. ",
    "title": "Network of Danish Politicians"
  },
  "legend": {
    "edgeLabel": "Wikilinks",
    "colorLabel": "Party",
    "nodeLabel": "Politicians"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Party",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}